Repository: dened/owlistic
Catalog: lib/src/localization/intl_*.arb
Languages: de, ru, uk

# helpListHeader
source: Available commands:
de: Verfügbare Befehle:

# helpCommandDescription
source: Show this help message
de: Diese Hilfenachricht anzeigen

# startCommandDescription
source: Start the bot and accept the privacy policy
de: Den Bot starten und die Datenschutzrichtlinie akzeptieren

# checkNowCommandDescription
source: Check for results now
de: Jetzt nach Ergebnissen suchen

# languageCommandDescription
source: Set your preferred language
de: Bevorzugte Sprache einstellen

# addCommandDescription
source: Add new exam search data
de: Neue Prüfungssuchdaten hinzufügen

# showCommandDescription
source: Show all your saved search data
de: Alle gespeicherten Suchdaten anzeigen

# deleteCommandDescription
source: Delete saved search data
de: Gespeicherte Suchdaten löschen

# deleteMeCommandDescription
source: Delete all your data and revoke consent
de: Alle Ihre Daten löschen und die Einwilligung widerrufen

# privacyPolicyButtonText
source: 📄 Privacy Policy
de: 📄 Datenschutzrichtlinie
ru: 📄 Политика конфиденциальности
uk: 📄 Політика конфіденційності

# agreeButtonText
source: ✅ Agree
de: ✅ Zustimmen
ru: ✅ Принять
uk: ✅ Прийняти

# declineButtonText
source: ❌ Decline
de: ❌ Ablehnen
ru: ❌ Отклонить
uk: ❌ Відхилити

# startWelcomeMessage
source: 👋 Welcome to the telc certificate checker bot! This bot helps you check your telc exam results quickly and easily. To add your exam data, use the /add command. You can also view your saved data with /show, delete it with /delete, or revoke consent and delete all your data with /delete_me.
de: 👋 Willkommen beim telc Zertifikat-Checker-Bot! Dieser Bot hilft Ihnen, Ihre telc Prüfungsergebnisse schnell und einfach zu überprüfen. Um Ihre Prüfungsdaten hinzuzufügen, verwenden Sie den Befehl /add. Sie können Ihre gespeicherten Daten auch mit /show anzeigen, mit /delete löschen oder die Einwilligung widerrufen und alle Ihre Daten mit /delete_me löschen.
uk: 👋 Ласкаво просимо до бота для перевірки сертифікатів telc! Цей бот допоможе вам швидко та легко перевірити результати ваших іспитів telc. Щоб додати дані вашого іспиту, скористайтеся командою /add. Ви також можете переглянути збережені дані за допомогою /show, видалити їх за допомогою /delete або відкликати згоду та видалити всі ваші дані за допомогою /delete_me.

# consentGivenMessage
source: Thank you for your consent! You can now use all bot features. To add your exam data, use the /add command.
de: Vielen Dank für Ihre Zustimmung! Sie können nun alle Bot-Funktionen nutzen. Um Ihre Prüfungsdaten hinzuzufügen, verwenden Sie den Befehl /add.
ru: Спасибо за ваше согласие! Теперь вы можете использовать все функции бота.
uk: Дякуємо за вашу згоду! Тепер ви можете використовувати всі функції бота. Щоб додати дані вашого іспиту, скористайтеся командою /add.

# consentDeclinedMessage
source: You have declined the terms. To use the bot, you need to agree to the Privacy Policy. You can restart the bot with /start to see the terms again.
de: Sie haben die Bedingungen abgelehnt. Um den Bot nutzen zu können, müssen Sie der Datenschutzrichtlinie zustimmen. Sie können den Bot mit /start neu starten, um die Bedingungen erneut anzuzeigen.
ru: Вы отклонили условия. Чтобы использовать бота, вам необходимо согласиться с Политикой конфиденциальности. Вы можете перезапустить бота с помощью команды /start, чтобы снова ознакомиться с условиями.
uk: Ви відхилили умови. Щоб користуватися ботом, вам потрібно погодитися з Політикою конфіденційності. Ви можете перезапустити бота за допомогою команди /start, щоб знову переглянути умови.

# mustAcceptConsentMessage
source: You need to agree to the Privacy Policy before using this feature. Please use the /start command to see the terms again.
de: Sie müssen der Datenschutzrichtlinie zustimmen, bevor Sie diese Funktion nutzen können. Bitte verwenden Sie den Befehl /start, um die Bedingungen erneut anzuzeigen.
ru: Вам необходимо согласиться с Политикой конфиденциальности перед использованием этой функции. Пожалуйста, используйте команду /start, чтобы снова ознакомиться с условиями.
uk: Вам потрібно погодитися з Політикою конфіденційності перед використанням цієї функції. Будь ласка, скористайтеся командою /start, щоб знову переглянути умови.

# startBotWith
source: 👋 Welcome to the telc certificate checker bot! For my operation, I will collect and process some data: * Your Telegram data: ID, language code – for identification and communication. * Data for certificate lookup: exam attendee number, birth date, and exam date. You will enter this data yourself. 📄 Found certificate information (e.g., "B2 Beruf") will be stored in the system. The retention period for such data is no more than 12 months. ⚠️ Important! You may enter data to search for another person's certificate. By providing such data, you confirm that you have all necessary permissions (e.g., consent from this person) for its processing via the bot for the specified purposes. By clicking the "Agree" button, you confirm your acceptance of our Privacy Policy
de: 👋 Willkommen beim telc Zertifikat-Checker-Bot! Für meinen Betrieb werde ich einige Daten sammeln und verarbeiten: * Ihre Telegram-Daten: ID, Sprachcode – zur Identifizierung und Kommunikation. * Daten für die Zertifikatssuche: Prüfungsteilnehmernummer, Geburtsdatum und Prüfungsdatum. Diese Daten geben Sie selbst ein. 📄 Gefundene Zertifikatsinformationen (z.B. "B2 Beruf") werden im System gespeichert. Die Aufbewahrungsfrist für solche Daten beträgt nicht mehr als 12 Monate. ⚠️ Wichtig! Sie können Daten eingeben, um das Zertifikat einer anderen Person zu suchen. Indem Sie solche Daten bereitstellen, bestätigen Sie, dass Sie alle erforderlichen Berechtigungen (z.B. Zustimmung dieser Person) für deren Verarbeitung über den Bot für die angegebenen Zwecke haben. Indem Sie auf die Schaltfläche "Zustimmen" klicken, bestätigen Sie Ihre Annahme unserer Datenschutzrichtlinie
ru: 👋 Добро пожаловать в бот для проверки сертификатов telc! Для моей работы я буду собирать и обрабатывать некоторые данные: * Ваши данные Telegram: ID, языковой код – для идентификации и коммуникации. * Данные для поиска сертификата: номер участника экзамена, дата рождения и дата экзамена. Эти данные вы вводите самостоятельно. 📄 Найденная информация о сертификате (например, "B2 Beruf") будет сохранена в системе. Срок хранения таких данных не превышает 12 месяцев. ⚠️ Важно! Вы можете вводить данные для поиска сертификата другого человека. Предоставляя такие данные, вы подтверждаете, что у вас есть все необходимые разрешения (например, согласие этого человека) на их обработку через бота в указанных целях. Нажимая кнопку "Принять", вы подтверждаете свое согласие с нашей Политикой конфиденциальности
uk: 👋 Ласкаво просимо до бота для перевірки сертифікатів telc! Для моєї роботи я збиратиму та оброблятиму деякі дані: * Ваші дані Telegram: ID, мовний код – для ідентифікації та комунікації. * Дані для пошуку сертифіката: номер учасника іспиту, дата народження та дата іспиту. Ці дані ви вводите самостійно. 📄 Знайдена інформація про сертифікат (наприклад, "B2 Beruf") буде збережена в системі. Термін зберігання таких даних не перевищує 12 місяців. ⚠️ Важливо! Ви можете вводити дані для пошуку сертифіката іншої особи. Надаючи такі дані, ви підтверджуєте, що маєте всі необхідні дозволи (наприклад, згоду цієї особи) на їх обробку через бота у зазначених цілях. Натискаючи кнопку "Прийняти", ви підтверджуєте свою згоду з нашою Політикою конфіденційності

# checkNowStart
source: Starting results check...
de: Ergebnisprüfung wird gestartet...
ru: Запуск проверки результатов...
uk: Запуск перевірки результатів...

# languageSelectPompt
source: Select your preferred language (English, German, Russian, Ukrainian):
de: Wählen Sie Ihre bevorzugte Sprache (Englisch, Deutsch, Russisch, Ukrainisch):
ru: Выберите предпочитаемый язык (Английский, Немецкий, Русский, Украинский):
uk: Виберіть бажану мову (Англійська, Німецька, Російська, Українська):

# langEnglish
source: English
de: Englisch
ru: Английский
uk: Англійська

# langGerman
source: German
de: Deutsch
ru: Немецкий
uk: Німецька

# langRussian
source: Russian
de: Russisch
ru: Русский
uk: Російська

# langUkrainian
source: Ukrainian
de: Ukrainisch
ru: Украинский
uk: Українська

# languageSelectedCallback
source: Language selected: {displayName}
de: Sprache ausgewählt: {displayName}
ru: Язык выбран: {displayName}
uk: Мову вибрано: {displayName}

# addPromptAttendeeNumber
source: Enter your 7-digit exam attendee number (e.g., 0312345).
de: Geben Sie Ihre 7-stellige Prüfungsteilnehmernummer ein (z.B. 0312345).
ru: Введите ваш 7-значный номер участника экзамена (например, 0312345).
uk: Введіть ваш 7-значний номер учасника іспиту (наприклад, 0312345).

# addPromptBirthDate
source: Enter your birth date in DD.MM.YYYY format.
de: Geben Sie Ihr Geburtsdatum im Format TT.MM.JJJJ ein.
ru: Введите вашу дату рождения в формате ДД.ММ.ГГГГ.
uk: Введіть вашу дату народження у форматі ДД.ММ.РРРР.

# addInvalidAttendeeNumber
source: Invalid attendee number. It must be 7 digits (e.g., 0312345). If you are sure the number is correct, please enter it again. If you do not know your number, enter 000 to skip this step.
de: Ungültige Teilnehmernummer. Sie muss 7-stellig sein (z.B. 0312345). Wenn Sie sicher sind, dass die Nummer korrekt ist, geben Sie sie bitte erneut ein. Wenn Sie Ihre Nummer nicht kennen, geben Sie 000 ein, um diesen Schritt zu überspringen.
ru: Неверный номер участника. Он должен состоять из 7 цифр (например, 0312345). Если вы уверены, что номер правильный, введите его еще раз. Если вы не знаете свой номер, введите 000, чтобы пропустить этот шаг.
uk: Неправильний номер учасника. Він повинен складатися з 7 цифр (наприклад, 0312345). Якщо ви впевнені, що номер правильний, введіть його ще раз. Якщо ви не знаєте свій номер, введіть 000, щоб пропустити цей крок.

# addInvalidBirthDate
source: Invalid birth date format! Please enter the date in DD.MM.YYYY format.
de: Ungültiges Geburtsdatumsformat! Bitte geben Sie das Datum im Format TT.MM.JJJJ ein.
ru: Неверный формат даты рождения! Пожалуйста, введите дату в формате ДД.ММ.ГГГГ.
uk: Неправильний формат дати народження! Будь ласка, введіть дату у форматі ДД.ММ.РРРР.

# addPromptExamDate
source: Enter your exam date in DD.MM.YYYY format.
de: Geben Sie Ihr Prüfungsdatum im Format TT.MM.JJJJ ein.
ru: Введите дату вашего экзамена в формате ДД.ММ.ГГГГ.
uk: Введіть дату вашого іспиту у форматі ДД.ММ.РРРР.

# addInvalidExamDate
source: Invalid exam date format! Please enter the date in {dateFormatPattern} format.
de: Ungültiges Prüfungsdatumsformat! Bitte geben Sie das Datum im Format {dateFormatPattern} ein.
ru: Неверный формат даты экзамена! Пожалуйста, введите дату в формате {dateFormatPattern}.
uk: Неправильний формат дати іспиту! Будь ласка, введіть дату у форматі {dateFormatPattern}.

# addSuccess
source: Information added successfully! You can view the list of added entries with /show or add a new one with /add. To delete data, use the /delete command.
de: Informationen erfolgreich hinzugefügt! Sie können die Liste der hinzugefügten Einträge mit /show anzeigen oder mit /add einen neuen hinzufügen. Um Daten zu löschen, verwenden Sie den Befehl /delete.
ru: Информация успешно добавлена! Вы можете просмотреть список добавленных записей с помощью /show или добавить новую с помощью /add. Для удаления данных используйте команду /delete.
uk: Інформацію успішно додано! Ви можете переглянути список доданих записів за допомогою /show або додати новий за допомогою /add. Для видалення даних використовуйте команду /delete.

# showNoData
source: No data added yet. Use /add to add new entries.
de: Noch keine Daten hinzugefügt. Verwenden Sie /add, um neue Einträge hinzuzufügen.
ru: Данные еще не добавлены. Используйте /add для добавления новых записей.
uk: Дані ще не додано. Використовуйте /add для додавання нових записів.

# showListHeader
source: List of added entries:
de: Liste der hinzugefügten Einträge:
ru: Список добавленных записей:
uk: Список доданих записів:

# showExamDatePrefix
source: Exam:
de: Prüfung:
ru: Экзамен:
uk: Іспит:

# deleteNoData
source: No data added yet. Nothing to delete.
de: Noch keine Daten hinzugefügt. Nichts zu löschen.
ru: Данные еще не добавлены. Нечего удалять.
uk: Дані ще не додано. Немає чого видаляти.

# deleteButtonDeleteAll
source: Delete All
de: Alles löschen
ru: Удалить все
uk: Видалити все

# deleteSelectPrompt
source: Select an entry to delete, or click "Delete All" to remove all entries.
de: Wählen Sie einen Eintrag zum Löschen aus oder klicken Sie auf "Alles löschen", um alle Einträge zu entfernen.
ru: Выберите запись для удаления или нажмите "Удалить все", чтобы удалить все записи.
uk: Виберіть запис для видалення або натисніть "Видалити все", щоб видалити всі записи.

# deleteAllSuccessCallback
source: All entries successfully deleted.
de: Alle Einträge erfolgreich gelöscht.
ru: Все записи успешно удалены.
uk: Всі записи успішно видалено.

# deleteOneSuccessCallback
source: Entry successfully deleted.
de: Eintrag erfolgreich gelöscht.
ru: Запись успешно удалена.
uk: Запис успішно видалено.

# certNotFoundMessage
source: No results found for the last {daysCount} days for user {attendeeNumber}
de: Für Benutzer {attendeeNumber} wurden in den letzten {daysCount} Tagen keine Ergebnisse gefunden
ru: Результаты не найдены за последние {daysCount} дней для пользователя {attendeeNumber}
uk: Результатів не знайдено за останні {daysCount} днів для користувача {attendeeNumber}

# certFoundTitle
source: Certificate found!
de: Zertifikat gefunden!
ru: Сертификат найден!
uk: Сертифікат знайдено!

# certFoundFullNameLabel
source: Full Name:
de: Vollständiger Name:
ru: ФИО:
uk: Повне ім'я:

# certFoundLinkText
source: Certificate Link
de: Zertifikat-Link
ru: Ссылка на сертификат
uk: Посилання на сертифікат

# deleteMeConfirmationMessage
source: Are you sure you want to revoke consent and delete all your data from the system?
de: Sind Sie sicher, dass Sie die Einwilligung widerrufen und alle Ihre Daten aus dem System löschen möchten?
ru: Вы действительно хотите отозвать согласие и удалить все свои данные из системы?
uk: Ви дійсно бажаєте відкликати згоду та видалити всі ваші дані з системи?

# deleteMeButtonYes
source: ✅ Yes, delete all
de: ✅ Ja, alles löschen
ru: ✅ Да, удалить всё
uk: ✅ Так, видалити все

# deleteMeButtonNo
source: ❌ No
de: ❌ Nein
ru: ❌ Нет
uk: ❌ Ні

# deleteMeSuccessMessage
source: Your consent has been revoked, and all your data has been successfully deleted from the system. If you wish to use the bot again, you will need to go through the consent procedure again by entering the /start command.
de: Ihre Einwilligung wurde widerrufen und alle Ihre Daten wurden erfolgreich aus dem System gelöscht. Wenn Sie den Bot erneut verwenden möchten, müssen Sie den Zustimmungsvorgang erneut durchlaufen, indem Sie den Befehl /start eingeben.
ru: Ваше согласие отозвано, и все ваши данные были успешно удалены из системы. Если вы захотите снова воспользоваться ботом, вам потребуется пройти процедуру согласия заново, введя команду /start.
uk: Вашу згоду відкликано, а всі ваші дані успішно видалено з системи. Якщо ви захочете знову скористатися ботом, вам потрібно буде пройти процедуру згоди заново, ввівши команду /start.

# deleteMeCancelledMessage
source: Action cancelled. Your data remains in the system.
de: Aktion abgebrochen. Ihre Daten bleiben im System.
ru: Действие отменено. Ваши данные остаются в системе.
uk: Дію скасовано. Ваші дані залишаються в системі.
